CSI API ETABS v1
cDesignShearWall.GetRebarPrefsPier Method
 Retrieves data from the Rebar Selection Rules for Wall Piers
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRebarPrefsPier(
	int Item,
	ref string Value
)
Function GetRebarPrefsPier (
	Item As Integer,
	ByRef Value As String
) As Integer
Dim instance As cDesignShearWall
Dim Item As Integer
Dim Value As String
Dim returnValue As Integer
returnValue = instance.GetRebarPrefsPier(Item,
	Value)
int GetRebarPrefsPier(
	int Item,
	String^% Value
)
abstract GetRebarPrefsPier :
        Item : int *
        Value : string byref -> int
Parameters
Item
Type: System.Int32
 An integer value corresponding to the data to be retrieved, from the following list
Vertical Bars - Unconfined Zones - Smallest Bar Size
Vertical Bars - Unconfined Zones - Largest Bar Size
Vertical Bars - Unconfined Zones - Preferred Corner/Joint Bar Size
Vertical Bars - Unconfined Zones - Preferred Middle Bar Size
Vertical Bars - Unconfined Zones - Minimum Spacing of Bars
Vertical Bars - Unconfined Zones - Maximum Spacing of Bars
Vertical Bars - Confined Zones - Smallest Bar Size
Vertical Bars - Confined Zones - Largest Bar Size
Vertical Bars - Confined Zones - Preferred Corner/Joint Bar Size
Vertical Bars - Confined Zones - Preferred Middle Bar Size
Vertical Bars - Confined Zones - Minimum Spacing of Bars
Vertical Bars - Confined Zones - Maximum Spacing of Bars
Transverse Bars - Unconfined Zones - Smallest Bar Size
Transverse Bars - Unconfined Zones - Largest Bar Size
Transverse Bars - Unconfined Zones - Preferred Bar Size
Transverse Bars - Unconfined Zones - Minimum Spacing of Bars
Transverse Bars - Unconfined Zones - Maximum Spacing of Bars
Transverse Bars - Unconfined Zones - Preferred Bar Arrangement
Transverse Bars - Confined Zones - Smallest Bar Size
Transverse Bars - Confined Zones - Largest Bar Size
Transverse Bars - Confined Zones - Preferred Bar Size
Transverse Bars - Confined Zones - Minimum Spacing of Bars
Transverse Bars - Confined Zones - Maximum Spacing of Bars
Transverse Bars - Confined Zones - Preferred Bar Arrangement
Value
Type: System.String
 The retrieved data; note that numerical values are converted to String
 If the Item is one of the Preferred Bar Arrangement options, then this value will be an integer from the following list:
Straight
UAndStraight
Hoops
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise returns non-zero
See Also
Reference
cDesignShearWall Interface
ETABSv1 Namespace